In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [104]:
acc = pd.read_csv('accommodations.csv')

In [105]:
acc.head()

,merch_state,month_date,accommodation_cost,transaction_count,unique_visitors,min_cost,max_cost,q25,q75,data_quality_flag,period_start,period_end,calculation_timestamp
0,FL,2025-06-01,214.320007,2940781,12806,56.270000,2850.500000,117.589996,458.290009,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:45:31.936689 UTC
1,CA,2025-06-01,225.399994,2723295,13628,60.009998,2055.679932,118.089996,426.779999,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:45:31.936689 UTC
2,TX,2025-06-01,200.330002,2711451,12908,57.630001,1433.630005,123.070000,378.690002,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:45:31.936689 UTC
3,NV,2025-06-01,192.130005,1968224,8067,60.380001,1359.060059,109.169998,349.179993,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:45:31.936689 UTC
4,TN,2025-06-01,207.639999,1428481,6557,56.810001,1692.209961,123.040001,392.399994,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:45:31.936689 UTC

In [106]:
acc.month_date.unique()

array(['2025-06-01', '2025-07-01', '2025-08-01'], dtype=object)

In [84]:
acc.sort_values(by='unique_visitors', ascending=True)[:10]

,merch_state,month_date,accommodation_cost,transaction_count,unique_visitors,min_cost,max_cost,q25,q75,data_quality_flag,period_start,period_end,calculation_timestamp
51,XX,2025-06-01,1107.770020,6,1,201.699997,1145.930054,201.699997,1145.930054,EXCLUDE,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
49,VT,2025-06-01,292.200012,117460,681,74.080002,1892.949951,183.029999,573.869995,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
50,RI,2025-06-01,323.049988,95194,686,62.419998,2165.250000,190.139999,623.450012,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
47,DE,2025-06-01,225.350006,220856,1471,60.189999,1387.339966,122.080002,408.910004,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
46,NH,2025-06-01,252.160004,235179,1718,61.810001,1464.660034,155.210007,430.059998,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
48,ME,2025-06-01,300.579987,217060,2075,63.869999,1912.839966,179.339996,527.549988,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
43,DC,2025-06-01,337.320007,594681,2606,61.580002,2506.070068,156.470001,768.359985,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
44,ND,2025-06-01,194.669998,564400,2905,73.830002,1010.900024,129.309998,316.760010,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
41,ID,2025-06-01,220.320007,949414,3886,59.860001,1497.930054,154.070007,370.489990,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC
45,CT,2025-06-01,209.720001,438712,4187,65.639999,1141.579956,111.230003,348.609985,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:25:45.964520 UTC

In [85]:
att = pd.read_csv('attractions.csv')

In [86]:
att.head()

,merch_state,month_date,attraction_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
0,NH,2025-06-01,8.290000,3824413,18239,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
1,XX,2025-06-01,16.129999,4197,81,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
2,TX,2025-06-01,18.780001,19098336,75407,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
3,GA,2025-06-01,19.840000,12437625,27959,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
4,NY,2025-06-01,20.250000,21169288,58295,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC

In [87]:
att.sort_values(by='unique_visitors', ascending=True)[:10]

,merch_state,month_date,attraction_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
1,XX,2025-06-01,16.129999,4197,81,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
40,RI,2025-06-01,32.200001,103091,749,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
6,VT,2025-06-01,20.950001,140574,1218,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
15,ND,2025-06-01,23.090000,261188,1368,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
41,MT,2025-06-01,32.439999,326240,2434,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
44,CT,2025-06-01,34.959999,523650,2448,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
47,ME,2025-06-01,35.770000,270048,2715,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
9,WY,2025-06-01,22.030001,892138,3247,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
20,DC,2025-06-01,25.190001,269187,3326,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
36,HI,2025-06-01,30.660000,1319120,5074,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC

In [103]:
att.head()

,merch_state,month_date,attraction_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
0,NH,2025-06-01,8.290000,3824413,18239,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
1,XX,2025-06-01,16.129999,4197,81,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
2,TX,2025-06-01,18.780001,19098336,75407,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
3,GA,2025-06-01,19.840000,12437625,27959,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
4,NY,2025-06-01,20.250000,21169288,58295,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC

In [89]:
att.sort_values(by='unique_visitors', ascending=True)[:10]

,merch_state,month_date,attraction_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
1,XX,2025-06-01,16.129999,4197,81,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
40,RI,2025-06-01,32.200001,103091,749,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
6,VT,2025-06-01,20.950001,140574,1218,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
15,ND,2025-06-01,23.090000,261188,1368,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
41,MT,2025-06-01,32.439999,326240,2434,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
44,CT,2025-06-01,34.959999,523650,2448,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
47,ME,2025-06-01,35.770000,270048,2715,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
9,WY,2025-06-01,22.030001,892138,3247,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
20,DC,2025-06-01,25.190001,269187,3326,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC
36,HI,2025-06-01,30.660000,1319120,5074,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:27:20.203618 UTC

In [90]:
rest = pd.read_csv('restaurants.csv')

In [91]:
rest.head()

,merch_state,month_date,breakfast_lunch_cost,dinner_cost,median_meal_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
0,XX,2025-06-01,9.310000,15.180000,11.820000,13160,68,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
1,DE,2025-06-01,7.500000,21.709999,11.300000,6540403,21514,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
2,OK,2025-06-01,15.090000,30.990000,21.260000,26816366,59090,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
3,DC,2025-06-01,16.139999,32.740002,22.160000,3482299,13563,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
4,UT,2025-06-01,17.120001,33.939999,24.139999,9232578,33510,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC

In [92]:
rest.sort_values(by='unique_visitors', ascending=True)[:10]

,merch_state,month_date,breakfast_lunch_cost,dinner_cost,median_meal_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
0,XX,2025-06-01,9.310000,15.180000,11.820000,13160,68,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
10,VT,2025-06-01,18.340000,38.480000,25.969999,1104548,5209,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
42,RI,2025-06-01,21.920000,46.650002,32.189999,1233851,6178,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
13,ND,2025-06-01,20.180000,39.040001,28.160000,3633629,10803,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
22,CT,2025-06-01,20.379999,40.840000,28.910000,2542217,11323,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
51,NH,2025-06-01,29.360001,56.820000,41.380001,2299458,12810,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
3,DC,2025-06-01,16.139999,32.740002,22.160000,3482299,13563,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
50,ME,2025-06-01,26.760000,56.310001,39.110001,3032380,15391,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
27,WY,2025-06-01,22.340000,42.209999,31.200001,5340949,17114,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC
38,MT,2025-06-01,22.950001,44.400002,32.220001,5388630,17856,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:28:41.001477 UTC

In [93]:
ret = pd.read_csv('retail.csv')

In [94]:
ret.head()

,merch_state,month_date,retail_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
0,CA,2025-06-01,29.750000,333567194,544979,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
1,NY,2025-06-01,43.070000,57980492,244715,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
2,FL,2025-06-01,39.500000,57816634,207822,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
3,TX,2025-06-01,42.549999,47081150,175356,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
4,OH,2025-06-01,54.419998,37032453,124611,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC

In [95]:
ret.sort_values(by='unique_visitors', ascending=True)[:10]

,merch_state,month_date,retail_cost,transaction_count,unique_visitors,data_quality_flag,period_start,period_end,calculation_timestamp
51,XX,2025-06-01,154.229996,74,6,EXCLUDE,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
49,DC,2025-06-01,25.639999,1067959,5073,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
50,RI,2025-06-01,37.009998,1034470,5951,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
48,VT,2025-06-01,51.799999,2923568,7657,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
42,WV,2025-06-01,37.279999,3975488,13248,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
45,NE,2025-06-01,42.430000,3276481,13553,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
47,ME,2025-06-01,35.470001,3078248,13767,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
46,NH,2025-06-01,39.119999,3160845,16409,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
44,ND,2025-06-01,54.840000,3518078,16487,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC
41,MT,2025-06-01,38.020000,4184011,17055,SINGLE_MONTH,2025-06-01,2025-08-31,2025-11-17 19:31:47.658768 UTC

In [96]:
merge_1 = pd.merge(acc, att, how='left', on=['merch_state', 'month_date'], suffixes=("_acc", "_att"))

In [97]:
merge_2 = pd.merge(rest, ret, how='left', on=['merch_state', 'month_date'], suffixes=("_rest", "_ret"))

In [98]:
final = pd.merge(merge_1, merge_2, how='left', on=['merch_state', 'month_date'])

In [101]:
final.month_date.unique()

array(['2025-06-01'], dtype=object)

In [100]:
final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 36 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   merch_state                 52 non-null     object
 1   month_date                  52 non-null     object
 2   accommodation_cost          52 non-null     float64
 3   transaction_count_acc       52 non-null     int64
 4   unique_visitors_acc         52 non-null     int64
 5   min_cost                    52 non-null     float64
 6   max_cost                    52 non-null     float64
 7   q25                         52 non-null     float64
 8   q75                         52 non-null     float64
 9   data_quality_flag_acc       52 non-null     object
 10  period_start_acc            52 non-null     object
 11  period_end_acc              52 non-null     object
 12  calculation_timestamp_acc   52 non-null     object
 13  attraction_cost             52 non-null     float64
 14  transaction_count_att       52 non-null     int64
 15  unique_visitors_att         52 non-null     int64
 16  data_quality_flag_att       52 non-null     object
 17  period_start_att            52 non-null     object
 18  period_end_att              52 non-null     object
 19  calculation_timestamp_att   52 non-null     object
 20  breakfast_lunch_cost        52 non-null     float64
 21  dinner_cost                 52 non-null     float64
 22  median_meal_cost            52 non-null     float64
 23  transaction_count_rest      52 non-null     int64
 24  unique_visitors_rest        52 non-null     int64
 25  data_quality_flag_rest      52 non-null     object
 26  period_start_rest           52 non-null     object
 27  period_end_rest             52 non-null     object
 28  calculation_timestamp_rest  52 non-null     object
 29  retail_cost                 52 non-null     float64
 30  transaction_count_ret       52 non-null     int64
 31  unique_visitors_ret         52 non-null     int64
 32  data_quality_flag_ret       52 non-null     object
 33  period_start_ret            52 non-null     object
 34  period_end_ret              52 non-null     object
 35  calculation_timestamp_ret   52 non-null     object
dtypes: float64(10), int64(8), object(18)
memory usage: 14.8+ KB

In [77]:
trim = final[['merch_state', 'accommodation_cost', 'attraction_cost', 'breakfast_lunch_cost', 'dinner_cost', 'median_meal_cost', 
              'retail_cost']]

In [78]:
trim.head()

,merch_state,accommodation_cost,attraction_cost,breakfast_lunch_cost,dinner_cost,median_meal_cost,retail_cost
0,CA,226.210007,21.980000,20.889999,43.700001,30.049999,29.719999
1,FL,204.929993,45.349998,27.030001,57.279999,39.570000,40.610001
2,TX,191.289993,18.900000,21.360001,41.990002,29.950001,42.189999
3,NV,200.199997,28.559999,24.590000,48.939999,34.340000,26.410000
4,TN,201.539993,31.639999,25.309999,46.509998,35.509998,40.919998

In [79]:
trim['cost_per_trip'] = (trim['accommodation_cost']*2)+ (trim['attraction_cost']*2)+ (trim['breakfast_lunch_cost']*4)+ (trim['dinner_cost']*2)+ (trim['retail_cost']*2)

/var/folders/tt/3g3mlsjs2ns5s373578hytch0000gp/T/ipykernel_31435/4074024167.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  trim['cost_per_trip'] = (trim['accommodation_cost']*2)+ (trim['attraction_cost']*2)+ (trim['breakfast_lunch_cost']*4)+ (trim['dinner_cost']*2)+ (trim['retail_cost']*2)

In [56]:
trim.head()

,merch_state,accommodation_cost,attraction_cost,breakfast_lunch_cost,dinner_cost,median_meal_cost,retail_cost,cost_per_trip
0,FL,205.309998,44.990002,27.040001,57.669998,39.830002,40.029999,804.159996
1,CA,221.559998,20.930000,20.900000,43.590000,30.090000,29.700001,715.159996
2,TX,190.220001,18.879999,21.650000,42.730000,30.510000,40.790001,671.840000
3,NV,193.809998,30.610001,24.570000,48.680000,34.240002,25.430000,695.339996
4,TN,199.919998,32.849998,26.000000,46.869999,36.139999,39.919998,743.119987

In [80]:
trim = trim.loc[trim['merch_state'] !='XX']

In [81]:
trim.to_csv('July_month_test.csv', index=False)